Enums/РежимФормированияПечатныхФорм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>РежимФормированияПечатныхФорм</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаЯзыкеИнформационнойБазы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаЯзыкеИнтерфейсаПользователя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРусскомЯзыке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаУкраинскомЯзыке</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыСооружений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыСооружений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Здание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паркинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Общежитие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппаЗданий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/Локализация/Ext/Module.bsl
//Преобразует код языка в формат понятный системной функции Формат()
// Параметры
//  КодЯзыка  	 – Строка – код языка в формате uk/ru
//
// Возвращаемое значение:
//   Строка   	 – код языка в формате ru_RU/uk_UA
//
Функция ОпределитьКодЯзыкаДляФормат(КодЯзыка) Экспорт
	
	Возврат ?(КодЯзыка = "uk","uk_UA","ru_RU");
	
КонецФункции // ОпределитьКодЯзыкаДляФормат()

//По коду языка возвращает строку параметров прописи из справочника Валюты 
//(ПараметрыПрописиНаРусском или ПараметрыПрописиНаУкраинском).
Функция ПараметрыПрописи(Валюта, КодЯзыка) Экспорт
	
	Возврат ?(КодЯзыка = "uk",Валюта.ПараметрыПрописиНаУкраинском,Валюта.ПараметрыПрописиНаРусском);
	
КонецФункции // ПараметрыПрописи()
       
// Возвращает код языка информационной базы, который указан 
// в региональных настройках (в конфигураторе)
Функция КодЯзыкаИнформационнойБазы() Экспорт
	
	// любой язык кроме украинского будем считать русским
	Возврат ?(КодЛокализации() = "uk_UA","uk","ru");
	
КонецФункции //КодЯзыкаИнформационнойБазы()

// Возвращает код языка интерфейса в формате ru/uk
Функция КодЯзыкаИнтерфейса() Экспорт
	
	Возврат ТекущийЯзык().КодЯзыка;
	
КонецФункции // КодЯзыкаИнтерфейса()

// Функция возвращает имя языка для формирования не регламентных печатных форм
// документов и некоторых справочников с учетом установленного режима в настройках
// пользователя. По-умолчанию это язык информационной базы.
//
// Параметры
//     	РежимПользователя - Установленное значение в настройках пользователя
//
// Возвращаемое значение:
//		Строка   – код языка
//
Функция ПолучитьЯзыкФормированияПечатныхФорм(РежимПользователя = Неопределено) Экспорт

	Если РежимПользователя = Неопределено Тогда
		
		РежимПользователя = ОСМДПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "РежимФормированияПечатныхФорм")
		
	КонецЕсли; 
	
	Если РежимПользователя = Перечисления.РежимФормированияПечатныхФорм.НаРусскомЯзыке Тогда
		
		КодЯзыкаПечать = "ru";
		
	ИначеЕсли РежимПользователя = Перечисления.РежимФормированияПечатныхФорм.НаУкраинскомЯзыке Тогда
		
		КодЯзыкаПечать = "uk";
		
	ИначеЕсли РежимПользователя = Перечисления.РежимФормированияПечатныхФорм.НаЯзыкеИнтерфейсаПользователя Тогда		
		
		КодЯзыкаПечать = КодЯзыкаИнтерфейса();
		
	Иначе
		
		КодЯзыкаПечать = КодЯзыкаИнформационнойБазы();
		
	КонецЕсли;

	Возврат КодЯзыкаПечать;
	
КонецФункции // ПолучитьЯзыкФормированияПечатныхФорм()

// Функция возвращает текстовую строку, сформированную на основании спец. шаблона,
// подставляя значения переданных параметров.	
// 
// Параметры
//  СтрокаШаблон – Строка – Строка шаблон, в тексте которой
//                 есть указания на то, куда вставить представления 
//                 параметров. 
//                 Параметры отмечаются текстом ¤1¤...¤20¤.
//                 Символ "¤" можно набрать при помощи Alt+0164
//  Пар1...Пар20 – произвольного типа – параметры,
//                 строковое представление которых будет 
//                 подставляться в шаблон.
//
// Возвращаемое значение:
//   Строка   – сформированная текстовая строка
//
Функция СтрШаблон_НеИспользуется(Знач СтрокаШаблон, 
										Знач Пар1  = "", Знач Пар2  = "",
										Знач Пар3  = "", Знач Пар4  = "", Знач Пар5  = "",
										Знач Пар6  = "", Знач Пар7  = "", Знач Пар8  = "",
										Знач Пар9  = "", Знач Пар10 = "", Знач Пар11 = "",
										Знач Пар12 = "", Знач Пар13 = "", Знач Пар14 = "",
										Знач Пар15 = "", Знач Пар16 = "", Знач Пар17 = "",
										Знач Пар18 = "", Знач Пар19 = "", Знач Пар20 = "") Экспорт
										
	ПризнакПараметра = "¤";
	МетаСимвол       = "\¤"; //заменяется на признак параметра
	
	Для Счетчик = 1 По 20 Цикл
			
		ПерваяПозицияВхожденияПараметра = Найти(СтрокаШаблон, ""+ ПризнакПараметра + Счетчик + ПризнакПараметра);
				
		Если ПерваяПозицияВхожденияПараметра = 0 Тогда
			// этот параметр не используется
			Продолжить;	
		КонецЕсли; 
				
		ПараметрВСтроку = "";
		Выполнить("ПараметрВСтроку = Строка(Пар" + Счетчик + ")");
				
		СтрокаШаблон = СтрЗаменить(СтрокаШаблон, ПризнакПараметра + Счетчик + ПризнакПараметра, ПараметрВСтроку);
				
	КонецЦикла;									
		
	ПозицияМетаСимвола = СтрЗаменить(СтрокаШаблон, МетаСимвол,ПризнакПараметра);

	Возврат СтрокаШаблон;
	
КонецФункции //СтрШаблон()

// Проверяет, соответсвует ли язык платформы 
Процедура ПроверитьСоответсвиеЯзыкаПлатформыИПользователя() Экспорт
	
	ЯзыкПлатформы = Лев(ТекущийЯзыкСистемы(),2);
	ЯзыкИнтерфейса = КодЯзыкаИнтерфейса();
	Если ЯзыкПлатформы <> ЯзыкИнтерфейса Тогда
		Сообщить(СтрШаблон(НСтр("ru='Язык интерфейса платформы 1С:Предприятие (%1) не совпадает с языком интерфейса пользователя (%2)!"
			"Для корректной работы рекомендуется устанавливать одинаковые языки!"
			"Запустить платформу 1С:Предприятие с необходимым языком интерфейса можно при помощи параметра запуска ""/L uk"" (или ""/L ru"").';uk='Мова інтерфейсу платформи 1С:Підприємство (%1) не співпадає з мовою інтерфейсу користувача (%2)!"
			"Для коректної роботи рекомендується встановлювати однакові мови!"
			"Запустити платформу 1С:Підприємство з необхідною мовою інтерфейсу можна за допомогою параметру запуску ""/L uk"" (або ""/L ru"").'"),ЯзыкПлатформы,ЯзыкИнтерфейса));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриСозданииНаСервере(ЭтаФорма, Ссылка = Неопределено) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВариантКоттеджныйПоселок") Тогда
	
		Если НЕ ЭтаФорма.Элементы.Найти("Здание") = Неопределено Тогда
			ЭтаФорма.Элементы.Здание.Заголовок = НСтр("ru='Коттеджный поселок';uk='Котеджне селище'"); 
			ЭтаФорма.Элементы.Здание.Подсказка = НСтр("ru='Коттеджный поселок';uk='Котеджне селище'");
		КонецЕсли;
		
		Если НЕ ЭтаФорма.Элементы.Найти("ОтборЗдание") = Неопределено Тогда
			ЭтаФорма.Элементы.ОтборЗдание.Заголовок = НСтр("ru='Коттеджный поселок';uk='Котеджне селище'");
		КонецЕсли;
		
		Если НЕ ЭтаФорма.Элементы.Найти("ЛицевыеСчетаСооружение") = Неопределено Тогда
			ЭтаФорма.Элементы.ЛицевыеСчетаСооружение.Заголовок = НСтр("ru='Коттеджный поселок';uk='Котеджне селище'"); 	
		КонецЕсли;
		
		Если НЕ ЭтаФорма.Элементы.Найти("ОтборПодъезд") = Неопределено Тогда
			ЭтаФорма.Элементы.ОтборПодъезд.Заголовок = НСтр("ru='Улица';uk='Вулиця'"); 	
		КонецЕсли;
		
		Если НЕ ЭтаФорма.Элементы.Найти("Подъезд") = Неопределено Тогда
			ЭтаФорма.Элементы.Подъезд.Заголовок = НСтр("ru='Улица';uk='Вулиця'"); 	
		КонецЕсли;
		
		Если НЕ ЭтаФорма.Элементы.Найти("ОтобранныеЛицевыеСчетаЗдание") = Неопределено Тогда
			ЭтаФорма.Элементы.ОтобранныеЛицевыеСчетаЗдание.Заголовок = НСтр("ru='Коттеджный поселок';uk='Котеджне селище'"); 	
		КонецЕсли;
		
		Если НЕ ЭтаФорма.Элементы.Найти("ОтобранныеЛицевыеСчетаПодъезд") = Неопределено Тогда
			ЭтаФорма.Элементы.ОтобранныеЛицевыеСчетаПодъезд.Заголовок = НСтр("ru='Улица';uk='Вулиця'"); 	
		КонецЕсли;
		
	ИначеЕсли ПолучитьФункциональнуюОпцию("ИспользоватьВариантГород") Тогда
		
		Если НЕ ЭтаФорма.Элементы.Найти("Здание") = Неопределено Тогда
			Если Ссылка <> Неопределено Тогда
				Если Ссылка.Здание.ТипСооружения = Перечисления.ТипыСооружений.ГруппаЗданий Тогда
					ЭтаФорма.Элементы.Здание.Заголовок = НСтр("ru='Группа зданий(поселок)';uk='Група будівель(селище)'"); 
					ЭтаФорма.Элементы.Здание.Подсказка = НСтр("ru='Группа зданий(поселок)';uk='Група будівель(селище)'");
				КонецЕсли;
			Иначе
				ЭтаФорма.Элементы.Здание.Заголовок = НСтр("ru='Объект учета';uk='Об`єкт обліку'");
				ЭтаФорма.Элементы.Здание.Подсказка = НСтр("ru='Объект учета';uk='Об`єкт обліку'");
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЭтаФорма.Элементы.Найти("ОтборЗдание") = Неопределено Тогда
			ЭтаФорма.Элементы.ОтборЗдание.Заголовок = НСтр("ru='Объект учета';uk='Об`єкт обліку'");
		КонецЕсли;
		
		Если НЕ ЭтаФорма.Элементы.Найти("ЛицевыеСчетаСооружение") = Неопределено Тогда
			ЭтаФорма.Элементы.ЛицевыеСчетаСооружение.Заголовок = НСтр("ru='Объект учета';uk='Об`єкт обліку'"); 	
		КонецЕсли;
		
		Если НЕ ЭтаФорма.Элементы.Найти("ОтборПодъезд") = Неопределено Тогда
			ЭтаФорма.Элементы.ОтборПодъезд.Заголовок = НСтр("ru='Подъезд\Улица';uk='Під`їзд\Вулиця'"); 	
		КонецЕсли;
		
		Если НЕ ЭтаФорма.Элементы.Найти("Подъезд") = Неопределено Тогда
			ЭтаФорма.Элементы.Подъезд.Заголовок = НСтр("ru='Подъезд\Улица';uk='Під`їзд\Вулиця'"); 	
		КонецЕсли;
		
		Если НЕ ЭтаФорма.Элементы.Найти("ОтобранныеЛицевыеСчетаЗдание") = Неопределено Тогда
			ЭтаФорма.Элементы.ОтобранныеЛицевыеСчетаЗдание.Заголовок = НСтр("ru='Объект учета';uk='Об`єкт обліку'"); 	
		КонецЕсли;
		
		Если НЕ ЭтаФорма.Элементы.Найти("ОтобранныеЛицевыеСчетаПодъезд") = Неопределено Тогда
			ЭтаФорма.Элементы.ОтобранныеЛицевыеСчетаПодъезд.Заголовок = НСтр("ru='Подъезд\Улица';uk='Під`їзд\Вулиця'"); 	
		КонецЕсли;
		
	КонецЕсли;

	
КонецПроцедуры

Процедура ПередЗаписьюНаСервере(Форма, ТекущийОбъект) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВариантКоттеджныйПоселок") Тогда
	
		Форма.АвтоЗаголовок = Ложь;
		Если ТипЗнч(ТекущийОбъект.Ссылка) = Тип("СправочникСсылка.ЗданияИСооружения") Тогда
			Форма.Заголовок = ТекущийОбъект.Наименование + НСтр("ru=' (Коттеджный поселок)';uk=' (Котеджне селище)'");
		ИначеЕсли ТипЗнч(ТекущийОбъект.Ссылка) = Тип("СправочникСсылка.Подъезды") Тогда
			Форма.Заголовок = ТекущийОбъект.Наименование + НСтр("ru=' (Улица)';uk=' (Вулиця)'");
		КонецЕсли;
		
	ИначеЕсли ПолучитьФункциональнуюОпцию("ИспользоватьВариантГород") Тогда
		
		Если ТипЗнч(ТекущийОбъект.Ссылка) = Тип("СправочникСсылка.ЗданияИСооружения") Тогда
			Если ТекущийОбъект.ТипСооружения = Перечисления.ТипыСооружений.ГруппаЗданий Тогда
				Форма.АвтоЗаголовок = Ложь;
				Форма.Заголовок = ТекущийОбъект.Наименование + НСтр("ru=' (Группа зданий)';uk=' (Група будівель)'");
			КонецЕсли;
		ИначеЕсли ТипЗнч(ТекущийОбъект.Ссылка) = Тип("СправочникСсылка.Подъезды") Тогда
			Если ТекущийОбъект.Владелец.ТипСооружения = Перечисления.ТипыСооружений.ГруппаЗданий Тогда
				Форма.АвтоЗаголовок = Ложь;
				Форма.Заголовок = ТекущийОбъект.Наименование + НСтр("ru=' (Улица)';uk=' (Вулиця)'");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки) Экспорт
	
	СхемаКомпоновкиДанных = ЭтотОбъект.СхемаКомпоновкиДанных;

	Для сч=0 По СхемаКомпоновкиДанных.НаборыДанных.Количество() - 1 Цикл
		ПолеЗдание = СхемаКомпоновкиДанных.НаборыДанных[сч].Поля.Найти("Здание");
			
		Если ПолеЗдание <> Неопределено Тогда
			ПолеЗдание.Заголовок = НСтр("ru='Коттеджный поселок';uk='Котеджне селище'");
		КонецЕсли;
		
		ПолеКвартира = СхемаКомпоновкиДанных.НаборыДанных[сч].Поля.Найти("Квартира");
			
		Если ПолеКвартира <> Неопределено Тогда
			ПолеКвартира.Заголовок = НСтр("ru='Коттедж';uk='Котедж'");
		КонецЕсли;
		
	КонецЦикла;
	
	// Програмный вывод СКД

	НастройкиОтчета = ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки();

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	МакетКомпоновки = КомпоновщикМакета.Выполнить(ЭтотОбъект.СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);

	//Создадим и инициализируем процессор компоновки

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;

	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);

	//Создадим и инициализируем процессор вывода результата

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;

	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);


	//Обозначим начало вывода

	ПроцессорВывода.НачатьВывод();

	ТаблицаЗафиксирована = Ложь;

	ДокументРезультат.ФиксацияСверху = 0;

	//Основной цикл вывода отчета

	Пока Истина Цикл

		//Получим следующий элемент результата компоновки

		ЭлементРезультата = ПроцессорКомпоновки.Следующий();


		Если ЭлементРезультата = Неопределено Тогда

			//Следующий элемент не получен - заканчиваем цикл вывода

			Прервать;

		Иначе

			// Зафиксируем шапку

			Если  Не ТаблицаЗафиксирована 

			И ЭлементРезультата.ЗначенияПараметров.Количество() > 0 

			И ТипЗнч(ЭтотОбъект.КомпоновщикНастроек.Настройки.Структура[0]) <> Тип("ДиаграммаКомпоновкиДанных") Тогда


				ТаблицаЗафиксирована = Истина;

				ДокументРезультат.ФиксацияСверху = ДокументРезультат.ВысотаТаблицы;

			КонецЕсли;

			//Элемент получен - выведем его при помощи процессора вывода

			ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);

		КонецЕсли;

	КонецЦикла;

	ПроцессорВывода.ЗакончитьВывод();
	
КонецПроцедуры
